InformationRegisters/Renault_ФотографииАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ФотографииАвтомобилей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ФотографииАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ракурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_РакурсыФотографий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ФотографииАвтомобилей/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "Фотография" Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ИмяФайла = ПолучитьИмяВременногоФайла(ПолучитьРасширение(ТекущиеДанные.Фотография));
		ДвоичныеДанные = ПолучитьДвоичныеДанныеФотографии(ТекущиеДанные.Фотография);
		ДвоичныеДанные.Записать(ИмяФайла);
		ЗапуститьПриложение(ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРасширение(Фотография)
	Возврат Фотография.Фотография.Расширение;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДвоичныеДанныеФотографии(Фотография)
	
	Возврат Фотография.Фотография.Получить();
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Автомобили") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Автомобили", Параметры.Автомобили);
		Автомобили.ЗагрузитьЗначения(Параметры.Автомобили);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ПараметрыФормы = Новый Структура;
	Если Автомобили.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли Автомобили.Количество() = 1 Тогда
		ПараметрыФормы.Вставить("Автомобиль", Автомобили[0].Значение);
	Иначе
		Автомобиль = ВыбратьИзСписка(Автомобили);
		Если ЗначениеЗаполнено(Автомобиль) Тогда
			ПараметрыФормы.Вставить("Автомобиль", Автомобиль);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.Renault_ФотографииАвтомобилей.Форма.ФормаЗаписи", ПараметрыФормы);	
КонецПроцедуры
